# Read the Verilog design
read_verilog RTL/verilog/*.v

# Perform generic synthesis
synth -top FA_8bit

# Write the synthesized netlist to JSON
write_json FA_8bit.json

# Print the output in vectorial format
show -format svg -prefix my_design_graph FA_8bit